# DekanewtonsPerSquareMeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..DekanewtonsPerSquareMeter Property
UnitTypeId Class See Also
---
Dekanewtons per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DekanewtonsPerSquareMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DekanewtonsPerSquareMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DekanewtonsPerSquareMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace